Documents/абс_ТранспортныйМаршрут/абс_ТранспортныйМаршрут.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ТранспортныйМаршрут</name>
  <attributes>
    <name>СводнаяЗаявкаНаТранспорт</name>
    <type>
      <types>DocumentRef.абс_СводнаяЗаявкаНаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.абс_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТКПеревозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодительЭкспедитор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПломбы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыЗаявокНаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоручениеЭкспедитору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияПутевогоЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПутевогоЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияТранспортногоМаршрута</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Задания</name>
    <attributes>
      <name>ЗаявкаНаТранспорт</name>
      <type>
        <types>DocumentRef.абс_ЗаявкаНаТранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормироватьДоверенность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Доверенность</name>
      <type>
        <types>DocumentRef.Доверенность</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <comment>(Общ)</comment>
  <basedOn>Catalog.Организации</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеОписание</name>
    <comment>(Общ) Дополнительное описание</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникИнформацииПриОбращении</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.ИсточникиИнформацииПриОбращенииПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <comment>(Регл) </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>(Регл) Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>(Регл) Код причины постановки на учет</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойДоговорКонтрагента</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойВидДеятельности</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.ВидыДеятельностиКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджерПокупателя</name>
    <comment>(Упр) Основной менеджер</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасписаниеРаботыСтрокой</name>
    <comment>(Общ) Расписание работы строкой</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокВыполненияЗаказаПоставщиком</name>
    <comment>(Упр)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеКонтактноеЛицо</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.КонтактныеЛицаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЯвляетсяРезидентом</name>
    <comment>(Регл)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКОПФ</name>
    <type>
      <types>CatalogRef.КлассификаторОКОПФ</types>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступаКонтрагента</name>
    <type>
      <types>CatalogRef.ГруппыДоступаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_GLN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_СтатусКонтрагента</name>
    <type>
      <types>EnumRef.абс_СтатусыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОсновнойСпособДоставки</name>
    <type>
      <types>CatalogRef.абс_СпособыДоставкиКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ВходитВХолдинг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Холдинг</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Предшественник</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_НаименованиеИностранное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Отдел</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_БизнесРегион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Территория</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Город</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_РегионКЛАДР</name>
    <type>
      <types>CatalogRef.абс_Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ГородКЛАДР</name>
    <type>
      <types>CatalogRef.абс_Города</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_KodKorУТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_KodKor</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОсновнойАдресКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_KodSeti</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_молочники</name>
    <comment>количество &quot;молочников&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_пектиншики</name>
    <comment>количество &quot;пектинщиков&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_ЛППшники</name>
    <comment>количество &quot;ЛППшников&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_молочники_потенциал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_пектиншики_потенциал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_ЛППшники_потенциал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_GUID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>46</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОператорEDI</name>
    <type>
      <types>CatalogRef.Лео_ОператорыЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ВторичныйПокупатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаКузова</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаПолаКузова</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемпературныйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МедицинскаяКнижка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СанитарнаяОбработка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_КаналБюджет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_КлиентEDI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>лео_ДатаEDI</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_СДИЗ</name>
    <comment>сопроводительный документ по идентификации зерна</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛЕО_ОписаниеОсобенностейКонтрагента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыДеятельности</name>
    <comment>(Упр)</comment>
    <attributes>
      <name>ВидДеятельности</name>
      <type>
        <types>CatalogRef.ВидыДеятельностиКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаКонтрагентов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МенеджерыПокупателя</name>
    <comment>(Упр)</comment>
    <attributes>
      <name>МенеджерПокупателя</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>абс_РучнойВвод</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦФО</name>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Documents/абс_ТранспортныйМаршрут/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Номер = "";
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//Если Организация.Пустая() Тогда
	//	ОбщегоНазначения.СообщитьОбОшибке("Не указана организация", Отказ);
	//КонецЕсли;
	//
	//Если ЭтотОбъект.Статус = Перечисления.абс_СтатусыЗаявокНаТранспорт.Закрыт И НЕ ЭтотОбъект.Ссылка.Статус = ЭтотОбъект.Статус Тогда
	//	ЭтотОбъект.ДатаЗакрытияТранспортногоМаршрута = ТекущаяДата();		
	//КонецЕсли
	
КонецПроцедуры

//номер должен быть в формате "ММ/ДД-НННН", где НННН - порядковый номер документа в данном дне
//
Функция ПолучитьНомерНовогоТранспортногоМаршрута() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	абс_ТранспортныйМаршрут.Номер КАК Номер,
	               |	ПОДСТРОКА(абс_ТранспортныйМаршрут.Номер, 10, 4) КАК ПорядковыйНомерЗаДень
	               |ИЗ
	               |	Документ.абс_ТранспортныйМаршрут КАК абс_ТранспортныйМаршрут
	               |ГДЕ
	               |	абс_ТранспортныйМаршрут.Дата МЕЖДУ &НачДата И &КонДата";
	
	Запрос.УстановитьПараметр("НачДата",НачалоДня(Дата));
	Запрос.УстановитьПараметр("КонДата",КонецДня(Дата));
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И Ссылка <> &Ссылка
		|";
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|УПОРЯДОЧИТЬ ПО
	|	ПорядковыйНомерЗаДень УБЫВ
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЧислоПорядковыйНомер = Число(Выборка.ПорядковыйНомерЗаДень);
		Если ТипЗнч(ЧислоПорядковыйНомер) = Тип("Число") Тогда
			ЧислоПорядковыйНомер = ЧислоПорядковыйНомер + 1;
			ДлинаНомера = СтрДлина(ЧислоПорядковыйНомер);
			ПорядковыйНомерСтрока = "";
			Для сч = 1 по 4-ДлинаНомера Цикл
				ПорядковыйНомерСтрока = ПорядковыйНомерСтрока + "0";
			КонецЦикла;
			ПорядковыйНомерСтрока = ПорядковыйНомерСтрока + Строка(ЧислоПорядковыйНомер);
		Иначе //не удалось преобразовать фрагмент номера в число
			Возврат "";
		КонецЕсли;
	Иначе
		ПорядковыйНомерСтрока = "0001";
	КонецЕсли;
	
	Префикс = Организация.Префикс;
	
	Возврат Префикс + Сред(Дата,4,2) + "/" + Лев(Дата,2) + "-" + ПорядковыйНомерСтрока;
	
КонецФункции

Процедура ПроверитьТранспортноеСредствоПоМаршруту(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ТранспортноеСредство) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	абс_ТранспортныйМаршрут.Ссылка
	|ИЗ
	|	Документ.абс_ТранспортныйМаршрут КАК абс_ТранспортныйМаршрут
	|ГДЕ
	|	абс_ТранспортныйМаршрут.СводнаяЗаявкаНаТранспорт.ДатаИсполнения = &ДатаИсполнения
	|	И абс_ТранспортныйМаршрут.ТранспортноеСредство = &ТранспортноеСредство
	|	И абс_ТранспортныйМаршрут.Ссылка <> &Ссылка");
	
	Запрос.УстановитьПараметр("ДатаИсполнения"		, СводнаяЗаявкаНаТранспорт.ДатаИсполнения);
	Запрос.УстановитьПараметр("ТранспортноеСредство", ТранспортноеСредство);
	Запрос.УстановитьПараметр("Ссылка"				, Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТекстСообщенияОбОшибке = "Транспортное средство уже использовано в ";
	
	Пока Выборка.Следующий() Цикл
		
		ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + Строка(Выборка.Ссылка) + " ";
		
	КонецЦикла;
	
	Если Выборка.Количество() > 0 Тогда
		
		ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщенияОбОшибке, Отказ);
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПроверитьЗаявкиВМаршруте(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_ТранспортныйМаршрутЗадания.Ссылка КАК ТранспортныйМаршрут,
	|	ТекущийТранспортныйМаршрут.ЗаявкаНаТранспорт
	|ИЗ
	|	Документ.абс_ТранспортныйМаршрут.Задания КАК ТекущийТранспортныйМаршрут
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.абс_ТранспортныйМаршрут.Задания КАК абс_ТранспортныйМаршрутЗадания
	|		ПО ТекущийТранспортныйМаршрут.ЗаявкаНаТранспорт = абс_ТранспортныйМаршрутЗадания.ЗаявкаНаТранспорт
	|ГДЕ
	|	абс_ТранспортныйМаршрутЗадания.Ссылка <> &Ссылка
	|	И ТекущийТранспортныйМаршрут.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбщегоНазначения.СообщитьОбОшибке("" + Выборка.ЗаявкаНаТранспорт + " уже включена в " + Выборка.ТранспортныйМаршрут);
		КонецЦикла;
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//ПроверитьЗаявкиВМаршруте(Отказ);
	//ПроверитьТранспортноеСредствоПоМаршруту(Отказ);
	////{Лео_Катанович
	//ПроверитьТребованияКТС(Отказ);	
	////Лео_Катанович}
	
КонецПроцедуры

Процедура ПроверитьТребованияКТС(Отказ)
	
	ТекстСообщенияОбОшибке= "";
	
	Если НЕ ЗначениеЗаполнено(ТранспортноеСредство) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	абс_ТранспортныйМаршрутЗадания.ЗаявкаНаТранспорт.Контрагент
	|ПОМЕСТИТЬ ТЗ_Контрагенты
	|ИЗ
	|	Документ.абс_ТранспортныйМаршрут.Задания КАК абс_ТранспортныйМаршрутЗадания
	|ГДЕ
	|	абс_ТранспортныйМаршрутЗадания.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ_Контрагенты.ЗаявкаНаТранспортКонтрагент КАК Контрагент,
	|	ВложенныйЗапрос.ШиринаКузова,
	|	ВложенныйЗапрос.ВысотаПолаКузова,
	|	ВложенныйЗапрос.ТемпературныйРежим,
	|	ВложенныйЗапрос.МедицинскаяКнижка,
	|	ВложенныйЗапрос.СанитарнаяОбработка
	|ИЗ
	|	ТЗ_Контрагенты КАК ТЗ_Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Контрагенты.ШиринаКузова КАК ШиринаКузова,
	|			Контрагенты.ВысотаПолаКузова КАК ВысотаПолаКузова,
	|			Контрагенты.ТемпературныйРежим КАК ТемпературныйРежим,
	|			Контрагенты.МедицинскаяКнижка КАК МедицинскаяКнижка,
	|			Контрагенты.СанитарнаяОбработка КАК СанитарнаяОбработка,
	|			Контрагенты.Ссылка КАК Ссылка
	|		ИЗ
	|			Справочник.Контрагенты КАК Контрагенты) КАК ВложенныйЗапрос
	|		ПО ТЗ_Контрагенты.ЗаявкаНаТранспортКонтрагент = ВложенныйЗапрос.Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ТранспортноеСредство.ШиринаКузова <  Выборка.ШиринаКузова Тогда
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + "Ширина кузова ТС не соответствует требованиям " + Выборка.Контрагент + Символы.ВК;
		КонецЕсли;
		
		Если ТранспортноеСредство.ВысотаПолаКузова <  Выборка.ВысотаПолаКузова Тогда
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + "Высота пола кузова ТС не соответствует требованиям " + Выборка.Контрагент + Символы.ВК;
		КонецЕсли;
		
		Если (ТранспортноеСредство.ТемпературныйРежим = Ложь И Выборка.ТемпературныйРежим = Истина) Тогда
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + "Температурный режим ТС не соответствует требованиям " + Выборка.Контрагент + Символы.ВК;
		КонецЕсли;
						
		Если  Выборка.МедицинскаяКнижка Тогда
			Если ТранспортноеСредство.МедицинскаяКнижка = Ложь Тогда
				ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + "Медицинская книжка не соответствует требованиям " + Выборка.Контрагент + Символы.ВК;
			КонецЕсли;
			Если  ТранспортноеСредство.МедицинскаяКнижкаСрокДействияДо < Ссылка.Дата Тогда
				ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + "Срок действия медицинской книжки не соответствует требованиям " + Выборка.Контрагент + Символы.ВК;
			КонецЕсли;
		КонецЕсли;
		
		Если Выборка.СанитарнаяОбработка Тогда
		     Если ТранспортноеСредство.СанитарнаяОбработка = Ложь Тогда
			      ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + "Санитарная обработка ТС не соответствует требованиям " + Выборка.Контрагент + Символы.ВК;
		     КонецЕсли;
		     Если ТранспортноеСредство.СанитарнаяОбработкаСрокДействияДо < Ссылка.Дата Тогда
			      ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + "Срок действия санитарной обработки не соответствует требованиям " + Выборка.Контрагент + Символы.ВК;
			 КонецЕсли;
		КонецЕсли;
	  
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекстСообщенияОбОшибке) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщенияОбОшибке, Отказ);
	Иначе
		//Если  ТранспортноеСредство.МедицинскаяКнижкаСрокДействияДо < Ссылка.Дата Тогда
		//		ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + "Внимание! Срок действия медицинской книжки завершен!";
		//КонецЕсли;
		//Если ТранспортноеСредство.СанитарнаяОбработкаСрокДействияДо < Ссылка.Дата Тогда
		//		  ТекстСообщенияОбОшибке = "Внимание! Срок действия санитарной обработки завершен!" ;
		//КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры
//Лео_Катанович}
